{
    "Adzuki Beans":{
        "common name":"Vigna angularis the adzuki bean (Japanese: 小豆 (アズキ), azuki, Uncommon アヅキ, adzuki) also azuki bean, aduki bean, red bean, or red mung bean)",
        "description1":"Adzuki beans also provide good amounts of antioxidants, which are beneficial plant compounds that can protect your body against aging and diseases .Studies show that adzuki beans may contain up to 29 different types of antioxidants, making them one of the most antioxidant-rich foods available.However, like all beans, adzuki beans also harbor antinutrients, which reduce your body’s ability to absorb minerals from the beans.",
        "plant":"Adzuki beans are small reddish-brown beans that grow inside long green pods. The flesh of adzuki is creamy when cooked and has a sweet, nutty flavor. The plant itself grows 1 to 2 feet (0.5 m.) in height, producing yellow flowers followed by clusters of pods.",
        "fruit":"Adzuki pods are smooth, cylindrical and thin-walled.[12][13] The colour of the pods is green turning white to grey as they mature.[12][13] The size is between 5–13 cm × 0.5 cm with 2 to 14 seeds per pod.[8][13] Pod shatter during seed ripening and harvesting might be a difficulty under certain conditions.",
        "cultivation":"Adzuki Bean is a short-day annual species that grows well in northern hemisphere temperate climates from 35 to 48 degrees N latitude. Generally, its climatic requirements and growing conditions are similar to those of soybean. Adzuki Bean is moderately drought tolerant. It can grow well in regions having an annual precipitation ranging from 530 to 1730 mm (20-68 in). It has been grown successfully in a range of soil types including silt loams and sandy soils. It does not tolerate water-logged soils.",
        "production":"China has remained the world's leading producer of peas, faba beans, mung beans, and adzuki beans in recent decades, as documented by FAO statistics and China Agriculture Statistical Reports.",
        "image1":"https://balconygardenweb-lhnfx0beomqvnhspx.netdna-ssl.com/wp-content/uploads/2015/10/03-8-1_mini.jpg",
        "image2":"https://3.imimg.com/data3/LJ/DE/MY-13802415/azuki-bean-250x250.jpg"
    },
    "Black gram":{
        "common name":"Black gram, urd bean, urad bean, black lentil, black matpe bean, mungo bean [English]; ambérique, haricot urd [French]; feijão-da-India, feijão-preto [Portuguese]; frijol mungo, fréjol negro, frijol negro, lenteja negra, urd [Spanish]; Urdbohne, Linsenbohne [German]; fagiolo indiano nero, fagiolo mungo nero [Italian]; mchooko mweusi [Swahili]; Đậu mười [Vietnamese]; عدس أسود[Arabic]; বিউলি, কলাই , মাসকলাই  [Bengali]; અડદ [Gujarati]; उड़द दाल [Hindi]; ケツルアズキ [Japanese]; ವಿಗ್ನಾ ಮುಂಗೊ [Kannada]; ഉഴുന്ന് [Malayalam]; उडीद [Marathi]; मास [Nepali]; Урд [Russian]; උඳු [Sinhala]; உளுந்து [Tamil]; మినుములు [Telugu]; ถั่วดำ [Thai] Black gram fodder Black gram straw, black gram haulms, urd bhoosa Black gram seeds Black gram chuni, Black gram bran, urd chuni, mashkalai bran, moong chuni",
        "description1":"Black gram (Vigna mungo (L.) Hepper) is an erect, fast-growing annual, herbaceous legume reaching 30-100 cm in height. It has a well-developed taproot and its stems are diffusely branched from the base. Occasionally it has a twining habit and it is generally pubescent. The leaves are trifoliate with ovate leaflets, 4-10 cm long and 2-7 cm wide. The inflorescence is borne at the extremity of a long (up to 18 cm) peduncle and bears yellow, small, papilionaceous flowers. The fruit is a cylindrical, erect pod, 4-7 cm long x 0.5 cm broad. The pod is hairy and has a short hooked beak. It contains 4-10 ellipsoid black or mottled seeds (Ecocrop, 2011; Jansen, 2006). Many Vigna mungo cultivars exist, each one adapted to specific environmental conditions. Early maturing, disease resistant and easily cultivated cultivars have been obtained (Jansen, 2006).Vigna mungo resembles green gram (Vigna radiata (L.) R. Wilczek) with two main differences: the corolla of Vigna mungo is bright yellow while that of Vigna radiata is pale yellow; black gram pods are erect whereas they are pendulous for green gram. Black gram is somewhat more hairy than green gram; the white hilum also protrudes from the seed. Black gram is sown on heavier soils and green gram is sown on lighter soils (Göhl, 1982) Vigna mungo seeds are mainly a staple food and the dehulled and split seeds (dhal in Hindi) are a common dish in South Asia. They can be ground into flour and used for making papadum, a typical Indian flat bread (Jansen, 2006). Seeds, sprouts and green pods are edible and much appreciated for their high digestibility and lack of flatulence induction (Jansen, 2006; Fery, 2002). The seeds are normally too expensive to be used as a feed, even in areas of primary production (Rajaguru et al., 1985). The by-product of dhal processing (chuni or bran) constitutes about 15-20% of the seed weight and comprises hulls, germs and broken seeds. Chuni is a potential feed resource and large quantities are available in India and other Southern Asian countries where black gram is a popular food (Reddy et al., 2000).",
        "plant":"Black gram (Vigna mungo (L.) Hepper) is an erect, fast-growing annual, herbaceous legume reaching 30-100 cm in height. It has a well-developed taproot and its stems are diffusely branched from the base. Occasionally it has a twining habit and it is generally pubescent. The leaves are trifoliate with ovate leaflets, 4-10 cm long and 2-7 cm wide. The inflorescence is borne at the extremity of a long (up to 18 cm) peduncle and bears yellow, small, papilionaceous flowers",
        "fruit":"The fruit is a cylindrical, erect pod, 4-7 cm long x 0.5 cm broad. The pod is hairy and has a short hooked beak. It contains 4-10 ellipsoid black or mottled seeds (Ecocrop, 2011; Jansen, 2006). ",
        "cultivation":"Optimal growth conditions are average day temperatures ranging from 25°C to 35°C and annual rainfall of 600-1000 mm. It has poor tolerance of wet tropical climates but in high rainfall areas it can be grown during the dry period on residual moisture. It grows better on rich black vertisols or loamy soils, well-drained soils with a pH 6-7",
        "production":"Blackgram is cultivated in India in about 3.24 million hectare with average productivity of at 469 kg a hectare. ... The average production in India over the last decade was 1.4 million tonnes. The major producing states in India are Andhra Pradesh, Maharashtra, Madhya Pradesh, Tamil Nadu and Uttar Pradesh.",
        "image1":"https://www.asiafarming.com/wp-content/uploads/2018/02/Black-Gram-Growing-and-Cultivation-Practices.-e1523079398684.jpg",
        "image2":"https://www.farmnewsindia.in/wp-content/uploads/2019/11/67044222_404383186854745_720803436207013888_n.jpg"
    },
    "Chickpea":{
        "common name":"Chickpea, chick pea, Egyptian bean, gram pea, Bengal gram [English]; garbanzo [Spanish]; pois chiche [French]; grão-de-bico, ervilha-de-bengala [Portuguese]; kikkererwt [Dutch]; Kichererbse [German]; kacang arab [Indonesian]; cece [Italian]; nohut [Turkish]; Đậu gà [Vietnamese]; ሽምብራ [Amharic]; الحِـمّص [Arabic]; ছোলা [Bengali]; 鹰嘴豆 [Chinese]; نخود [Farsi]; Ρεβιθιά [Greek]; ચણા [Gujarati]; חמצה [Hebrew]; चना दाल [Hindi]; ヒヨコマメ [Japanese]; Нут [Russian]; கொண்டைக் கடலை [Tamil]; ถั่วลูกไก่ [Thai]; چنا [Urdu]",
        "plant":"The plant grows to 20–50 cm (8–20 in) high and has small, feathery leaves on either side of the stem. Chickpeas are a type of pulse, with one seedpod containing two or three peas. It has white flowers with blue, violet, or pink veins.",
        "description1":"The chickpea or chick pea (Cicer arietinum) is an annual legume of the family Fabaceae, subfamily Faboideae.[2][3] Its different types are variously known as gram[4][5] or Bengal gram,[5] garbanzo[5] or garbanzo bean, or Egyptian pea.[4] Chickpea seeds are high in protein. It is one of the earliest cultivated legumes, and 9500-year-old remains have been found in the Middle East.Dozens of varieties of chickpea are cultivated throughout the world. In general, American and Iranian chickpeas are sweeter than Indian chickpeas. Kermanshah chickpeas in sizes 8 and 9 are considered to be among the highest quality in the world.Desi chana has small, darker seeds and a rough coat. They are grown mostly in India and other parts of the Indian subcontinent, as well as in Ethiopia, Mexico, and Iran.[19] Desi means 'country' or 'native' in Hindi-Urdu; its other names include kala chana ('black chickpea' in Hindi-Urdu) or chholaa boot. Desi chana can be black, green or speckled. This variety is hulled and split to make chana dal.",
        "cultivation":"Agricultural yield for chickpea is often based on genetic and phenotypic variability which has recently been influenced by artificial selection.[32] The uptake of micronutrients such as inorganic phosphorus or nitrogen is vital to the plant development of Cicer arietinum, commonly known as the perennial chickpea.[33] Heat cultivation and micronutrient coupling are two relatively unknown methods that are used to increase the yield and size of the chickpea. Recent research has indicated that a combination of heat treatment along with the two vital micronutrients, phosphorus and nitrogen, are the most critical components to increasing the overall yield of Cicer arietinum.",
        "fruit":" The pod is pubescent, inflated and oblong, with 2 or 3 seeds. The seeds are variable in size (5 to 10 mm in diameter), shape (spherical to angular) and colour (creamy-white to black) (Ecoport, 2013; Bejiga et al., 2006; van der Maesen, 1989). ",
        "production":"India is the largest chickpea producer with 65% of global production. Other major producing countries: Pakistan, Turkey, Iran, Myanmar, Australia, Ethiopia, Canada, Mexico, and Iraq.",
        "image1":"https://cdn.harvesttotable.com/htt/2009/04/23180911/Chickpeas-bigstock-Fresh-Green-Chickpeas-Field-337227136-scaled.jpg",
        "image2":"https://upload.wikimedia.org/wikipedia/commons/e/ea/Sa-whitegreen-chickpea.jpg"
    },
    "Coconut":{
       "common name":"The coconut tree (Cocos nucifera) is a member of the palm tree family (Arecaceae) and the only living species of the genus Cocos.[1] The term 'coconut' (or the archaic 'cocoanut')[2] can refer to the whole coconut palm, the seed, or the fruit, which botanically is a drupe, not a nut. The name comes from the old Portuguese word coco, meaning 'head' or 'skull', after the three indentations on the coconut shell that resemble facial features. They are ubiquitous in coastal tropical regions and are a cultural icon of the tropics.",
       "description1":"It is one of the most useful trees in the world and is often referred to as the 'tree of life'. It provides food, fuel, cosmetics, folk medicine and building materials, among many other uses. The inner flesh of the mature seed, as well as the coconut milk extracted from it, form a regular part of the diets of many people in the tropics and subtropics. Coconuts are distinct from other fruits because their endosperm contains a large quantity of clear liquid, called coconut water or coconut juice. Mature, ripe coconuts can be used as edible seeds, or processed for oil and plant milk from the flesh, charcoal from the hard shell, and coir from the fibrous husk. Dried coconut flesh is called copra, and the oil and milk derived from it are commonly used in cooking – frying in particular – as well as in soaps and cosmetics. Sweet coconut sap can be made into drinks or fermented into palm wine or coconut vinegar. The hard shells, fibrous husks and long pinnate leaves can be used as material to make a variety of products for furnishing and decoration.The coconut has cultural and religious significance in certain societies, particularly in the Western Pacific Austronesian cultures where it features in the mythologies, songs, and oral traditions. It also had ceremonial importance in pre-colonial animistic religions.[3][4] It has also acquired religious significance in South Asian cultures, where it is used in Hindu rituals. It forms the basis of wedding and worship rituals in Hinduism. It also plays a central role in the Coconut Religion of Vietnam. The falling nature of their mature fruit has led to preoccupation with death by coconut.[3][5]" ,
       "plant":"Cocos nucifera is a large palm, growing up to 30 m (100 ft) tall, with pinnate leaves 4–6 m (13–20 ft) long, and pinnae 60–90 cm (2–3 ft) long; old leaves break away cleanly, leaving the trunk smooth.[41] On fertile soil, a tall coconut palm tree can yield up to 75 fruits per year, but more often yields less than 30.[42][43][44] Given proper care and growing conditions, coconut palms produce their first fruit in six to ten years, taking 15 to 20 years to reach peak production.[45]",
       "fruit":"Botanically, the coconut fruit is a drupe, not a true nut.[48] Like other fruits, it has three layers: the exocarp, mesocarp, and endocarp. The exocarp is the glossy outer skin, usually yellow-green to yellow-brown in color. The mesocarp is composed of a fiber, called coir, which has many traditional and commercial uses. Both the exocarp and the mesocarp make up the husk of the coconut, while the endocarp makes up the hard coconut shell. The endocarp is around 4 mm (0.16 in) thick and has three distinctive germination pores (micropyles) on the distal end. Two of the pores are plugged (the eyes), while one is functional.[49][50]",
       "cultivation":"Coconut palms are normally cultivated in hot and wet tropical climates. They need year round warmth and moisture to grow well and fruit. Coconut palms are hard to establish in dry climates, and cannot grow there without frequent irrigation; in drought conditions, the new leaves do not open well, and older leaves may become desiccated; fruit also tends to be shed.[59] The extent of cultivation in the tropics is threatening a number of habitats, such as mangroves; an example of such damage to an ecoregion is in the Petenes mangroves of the Yucatán.[78]",
       "production":"Indonesia is the world's largest producer of coconuts, with gross production of 15 million tonnes.[96] A sprouting coconut seed is the logo for Gerakan Pramuka Indonesia, the Indonesian scouting organization.[97]",
       "image1":"https://images-na.ssl-images-amazon.com/images/I/5127XM5iOvL.jpg",
       "image2":"https://img3.exportersindia.com/product_images/bc-full/2020/1/4782089/coconut-plant-1578564458-5222826.jpeg"
    },
    "Coffee":{
        "common name":"A coffee bean is a seed of the Coffea plant and the source for coffee. It is the pip inside the red or purple fruit often referred to as a cherry. Just like ordinary cherries, the coffee fruit is also a so-called stone fruit. Even though the coffee beans are not technically beans, they are referred to as such because of their resemblance to true beans",
        "description1":"The two most economically important varieties of coffee plant are the Arabica and the Robusta; ~60% of the coffee produced worldwide is Arabica and ~40% is Robusta.[5] Arabica beans consist of 0.8–1.4% caffeine and Robusta beans consist of 1.7–4.0% caffeine.[6] As coffee is one of the world's most widely consumed beverages, coffee beans are a major cash crop and an important export product, accounting for over 50% of some developing nations' foreign exchange earnings.[7] In 2017, 70% of total coffee production was exported, worth USD 19.9 billion.[8]",
        "plant":"Botanically coffee belongs to the family Rubiaceae among with gardenias and quinine. The coffee plant can grow to a great height and because of that it is described as a coffee tree. In the wild it can grow as high as 10 metres. On plantations and coffee producing farms, they are pruned to a height which is most comfortable for harvesting.",
        "fruit":"The trees produce edible red or purple fruits, which are described either as epigynous berries or as indehiscent drupes.[4] The fruit is often referred to as a coffee cherry,and it contains two seeds, called coffee beans.[5] Despite these terms, coffee is neither a true cherry (the fruit of certain species in the genus Prunus) nor a true bean (seeds from plants in the family Fabaceae). The flowers of the plant are white and smell like jasmine and orange. Coffee plants flower at different times: Coffea arabica flowers after rain and Robusta flowers irregularly"  ,
        "cultivation":"The coffee plant needs plenty of rain to grow, something like 1,500–2,000 mm a year. The temperature for growing is different: for Arabica it is 15–24 ˚C and for Robusta it is 24–30 ˚C as coffee is extremely vulnerable to frost. Its habitat is at high altitudes. For Arabica the optimum growth altitude is between 1000–2000 m above sea level and for Robusta it is around 100–700 m above sea level. The higher the altitude, the more aromatic the beans are when they ripen. Soil and the environment have also a very great influence on the flavour characteristics. Coffee is produced in about 60 countries. The biggest coffee producing countries are: Brazil, Colombia, Vietnam, Indonesia and India. Those countries mainly grow coffee for export. For example, Brazil exports around 23,000,000 sacks per year, and each sack weighs 60 kg.",
        "production":"Arabica is originally from Ethiopia and today it is grown around the world. Robusta was discovered in Congo and from there it has spread throughout tropical Africa and to Indonesia, Vietnam and beyond.About 65 % of the world’s output is Arabica, and 35 % is Robusta. Arabica's flavour is milder and has more nuances than Robusta. The strong flavour of Robusta makes it best suited to blends of dark roasted coffees like espresso or French-style coffees. Robusta also gives a stronger body and crema for espresso.",
        "image1":"https://images-na.ssl-images-amazon.com/images/I/81fxCy%2Biv-L._SL1280_.jpg",
        "image2":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ9yrMbEKcG2X1K0WsIV5sxI9ikKbrqRT1Rvw&usqp=CAU"
    },
    "Cotton":{
        "common name": "Cotton is the collective name given to four species of plants in the genus Gossypium, Gossypium hirsutum, Gossypium barbadense",
        "description1":"Cotton is the collective name given to four species of plants in the genus Gossypium, Gossypium hirsutum, Gossypium barbadense, Gossypium arboreum and Gossypium herbaceum which are perennial shrubs in the family Malvaceae grown for the fluffy fiber which protects the seeds of the plant. G. hirsutum accounts for approximately 90% of world wide cotton production today. Cotton plants possess a main stem giving rise to several branches at the top. The leaves of the plant are spirally arranged on the branches, have long petioles and have 3–5 triangular lobes. The plant produces a single flower on each axillary branch which can be red-purple, yellow or white in color and forms a leathery, oval seed capsule, or 'boll' which is 2–6 cm (0.8–2.4 in) long. Mature bolls will usually split open to reveal the characteristic white cotton fibers and the seed. The cotton plant can reach heights of 1–1.5 m (3.3–4.9 ft) and is usually cultivated as an annual, surviving only one growing season. Cotton may also be referred to as tree cotton and its center of origin is unknown although the plant has diversified from Mexico, north-east Africa and Arabia and Australia.",
        "plant":"Plants are 1–2 m high in modern cropping systems, sometimes higher in traditional, multiannual cropping systems, now largely disappearing. The leaves are broad and lobed, with three to five (or rarely seven) lobes. The seeds are contained in a capsule called a boll, each seed surrounded by fibres of two types",
        "fruit":"The fruit, called cotton bolls, then begin to develop. These green, immature bolls are a segmented pod containing approximately 32 immature seeds from which the cotton fibres will grow. The boll is considered a fruit because it contains seeds.",
        "cultivation":"Seventy percent of cotton is rainfed.  Clear sunshine & proper moisture level during boll formation is required. Moisture stress from 60 days to 120 days directly reduces the yield. More sunshine and warm humid climate favor the growth of the cotton crop. The low temperature at the boll opening creates a problem in the harvest.",
        "production":"The largest producers of cotton, as of 2017, are India and China, with annual production of about 18.53 million tonnes and 17.14 million tonnes, respectively; most of this production is consumed by their respective textile industries. The largest exporters of raw cotton are the United States, with sales of $4.9 billion, and Africa, with sales of $2.1 billion. The total international trade is estimated to be $12 billion. Africa's share of the cotton trade has doubled since 1980",
        "image1":"https://cff2.earth.com/uploads/2018/10/19133128/Cotton-plant-with-edible-seeds-could-offer-nutrition-to-millions-.png",
        "image2":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Cotton_plant.jpg/450px-Cotton_plant.jpg"
    },
    "Ground Nut":{
        "common name":"The peanut, also known as the groundnut,[2] goober (US),[3] pindar (US)[3] or monkey nut (UK), and taxonomically classified as Arachis hypogaea",
        "description1":"It is a legume crop grown mainly for its edible seeds. It is widely grown in the tropics and subtropics, being important to both small and large commercial producers. It is classified as both a grain legume[4] and, due to its high oil content, an oil crop.[5] World annual production of shelled peanuts was 44 million tonnes in 2016, led by China with 38% of the world total. Atypically among legume crop plants, peanut pods develop underground (geocarpy) rather than above ground. With this characteristic in mind, the botanist Carl Linnaeus gave peanuts the specific epithet hypogaea, which means under the earth",
        "plant":"The peanut is an annual herbaceous plant growing 30 to 50 cm (12 to 20 in) tall.[15] As a legume, it belongs to the botanical family Fabaceae (also known as Leguminosae, and commonly known as the legume, bean, or pea family).[1] Like most other legumes, peanuts harbor symbiotic nitrogen-fixing bacteria in their root nodules.The leaves are opposite and pinnate with four leaflets (two opposite pairs; no terminal leaflet); each leaflet is 1 to 7 centimetres (1⁄2 to 2+3⁄4 in) long and 1 to 3 cm (1⁄2 to 1+1⁄4 in) across. Like those of many other legumes, the leaves are nyctinastic; that is, they have sleep movements, closing at night",
        "fruit":"Peanut fruits develop underground, an unusual feature known as geocarpy.[17] After fertilization, a short stalk at the base of the ovary (often termed a gynophore, but which actually appears to be part of the ovary itself) elongates to form a thread-like structure known as a peg. This peg grows down into the soil, allowing the fruit to develop underground.[17] These pods (technically called legumes) are 3 to 7 centimetres (1 to 3 in) long, normally containing one to four seeds.[11][15] The shell of the peanut fruit consists primarily mesocarp with several large veins traversing its length.[17]",
        "cultivation":"Peanuts grow best in light, sandy loam soil with a pH of 5.9–7. Their capacity to fix nitrogen means that, providing they nodulate properly, peanuts benefit little or not at all from nitrogen-containing fertilizer,[18] and they improve soil fertility. Therefore, they are valuable in crop rotations. Also, the yield of the peanut crop itself is increased in rotations, through reduced diseases, pests and weeds. For example, in Texas, peanuts in a three-year rotation with corn yield 50% more than nonrotated peanuts.[18] Adequate levels of phosphorus, potassium, calcium, magnesium, and micronutrients are also necessary for good yields.[18] To develop well, peanuts need warm weather throughout the growing season. They can be grown with as little as 350 mm (14 in) of water,[19] but for best yields need at least 500 mm (20 in).[20] Depending on growing conditions and the cultivar of peanut, harvest is usually 90 to 130 days after planting for subspecies A. h. fastigiata types, and 120 to 150 days after planting for subspecies A. h. hypogaea types.[19][21][22] Subspecies A. h. hypogaea types yield more, and are usually preferred where the growing seasons are sufficiently long.",
        "production":"In 2019, world production of peanuts (reported as groundnuts in shells) was 49 million tonnes, a 7% increase over 2018 production.[14] China had 36% of global production, followed by India (14%) (table). Other significant producers were Nigeria, Sudan, and the United States.[14]",
        "image1":"https://www.agrifarming.in/wp-content/uploads/2015/02/Groundnut-Peanut-Production..jpg",
        "image2":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTMc5GDZHbL3ztC0Ns7v6TDy9DHdnls-V_I7Q&usqp=CAU"
    },
    "Jute":{
        "common name":"Different common names are used in different contexts, with jute applying to the fiber produced from the plant, and jute mallow leaves for the leaves used as a vegetable.Corchorus is a genus of about 40–100 species of flowering plants in the family Malvaceae, native to tropical and subtropical regions throughout the world",
        "description1":"Jute is a long, soft, shiny bast fiber that can be spun into coarse, strong threads. It is produced from flowering plants in the genus Corchorus, which is in the mallow family Malvaceae. The primary source of the fiber is Corchorus olitorius, but such fiber is considered inferior to that derived from Corchorus capsularis.Jute is the name of the plant or fiber used to make burlap, hessian or gunny cloth.Jute is one of the most affordable natural fibers, and second only to cotton in the amount produced and variety of uses. Jute fibers are composed primarily of the plant materials cellulose and lignin. Jute fiber falls into the bast fiber category (fiber collected from bast, the phloem of the plant, sometimes called the skin) along with kenaf, industrial hemp, flax (linen), ramie, etc.. The industrial term for jute fiber is raw jute. The fibers are off-white to brown, and 1–4 metres (3–13 feet) long. Jute is also called the golden fiber for its color and high cash value.",
        "plant":"The plants are tall, usually annual herbs, reaching a height of 2–4 m, unbranched or with only a few side branches. The leaves are alternate, simple, lanceolate, 5–15 cm long, with an acuminate tip and a finely serrated or lobed margin. The flowers are small (2–3 cm diameter) and yellow, with five petals; the fruit is a many-seeded capsule.",
        "fruit":"The jute fiber comes from the stem and ribbon (outer skin) of the jute plant. The fibers are first extracted by retting. The retting process consists of bundling jute stems together and immersing them in slow running water. There are two types of retting: stem and ribbon. After the retting process, stripping begins; women and children usually do this job. In the stripping process, non-fibrous matter is scraped off, then the workers dig in and grab the fibers from within the jute stem.",
        "cultivation":"The jute plant needs a plain alluvial soil and standing water. The suitable climate for growing jute (warm and wet) is offered by the monsoon climate, during the monsoon season. Temperatures from 20 to 40 °C (68–104 °F) and relative humidity of 70%–80% are favourable for successful cultivation. Jute requires 5–8 cm (2–3 in) of rainfall weekly, and more during the sowing time. Soft water is necessary for jute production.",
        "production":"Jute is a rain-fed crop with little need for fertilizer or pesticides, in contrast to cotton's heavy requirements. Production is concentrated mostly in Bangladesh, as well as India's states of Assam, Bihar, and West Bengal.[8] India is the world's largest producer of jute,[9][10] but imported approximately 162,000 tonnes[11] of raw fiber and 175,000 tonnes[12] of jute products in 2011. India, Pakistan, and China import significant quantities of jute fiber and products from Bangladesh, as do the United Kingdom, Japan, United States, France, Spain, Ivory Coast, Germany and Brazil.",
        "image1":"https://i.ytimg.com/vi/2xgauobNFco/maxresdefault.jpg",
        "image2":"https://i.ytimg.com/vi/2xgauobNFco/maxresdefault.jpg"

    },
    "Kidney Beans":{
        "common name":"The kidney bean is a variety of the common bean (Phaseolus vulgaris). It is named for its visual resemblance in shape and – for the red variety – colour to a human kidney. Red kidney beans should not be confused with other red beans, such as adzuki beans.Red kidney bean (also known as: common kidney bean, rajma in India, surkh (red) lobia in Pakistan).,Light speckled kidney bean (and long shape light speckled kidney bean).Red speckled kidney bean (and long shape light speckled kidney bean),White kidney bean (also known as cannellini in Italy, lobia in India, or safaid (white) lobia in Pakistan)",
        "description1":"The Kidney bean is a highly variable species with a long history. Bush varieties form erect bushes 20–60 cm (8–20 in) tall, while pole or running varieties form vines 2–3 m (7–10 ft) long. All varieties bear alternate, green or purple leaves, which are divided into three oval, smooth-edged leaflets, each 6–15 cm (2–6 in) long and 3–11 cm (1–4 in) wide. The white, pink, or purple flowers are about 1 cm long, and they give way to pods 8–20 cm (3–8 in) long and 1–1.5 cm wide. These may be green, yellow, black, or purple in color, each containing 4–6 beans. The beans are smooth, plump, kidney-shaped, up to 1.5 cm long, range widely in color, and are often mottled in two or more colors. Raw or undercooked beans contain a toxic protein called phytohaemagglutinin.[10]:254",
        "plant":"The Kideney bean pole or running varieties form vines 2–3 m (7–10 ft) long. All varieties bear alternate, green or purple leaves, which are divided into three oval, smooth-edged leaflets, each 6–15 cm (2–6 in) long and 3–11 cm (1–4 in) wide. The white, pink, or purple flowers are about 1 cm long, and they give way to pods 8–20 cm (3–8 in) long and 1–1.5 cm wide. These may be green, yellow, black, or purple in color, each containing 4–6 beans. The beans are smooth, plump, kidney-shaped, up to 1.5 cm long, range widely in color, and are often mottled in two or more colors. Raw or undercooked beans contain a toxic protein called phytohaemagglutinin.[10]:254",
        "fruit":"its fruit is Bean, seed or pod of rtain leguminous plants of the family Fabaceae. The genera Phaseolus and Vigna have several species each of well-known beans, though a number of economically important species can be found in various genera throughout the family. Rich in protein and providing moderate amounts of iron, thiamin, and riboflavin, beans are used worldwide for cooking in either fresh or dried form.",
        "cultivation":"It can be grown on wide range of soils from light sandy to heavy clay soils. Well drained loamy soil is good for kidney beans cultivation. It is very sensitive to saline soils. Gives best result when pH of soil is 5.5 to 6. Give two to three ploughing to bring soil at fine tilth. Make field level so that water stagnation should not occurred in main field. Crop is very sensitive to water logging. At last ploughing apply Farmyard Manure or well decomposed cow dung@60-80qtl/acre.",
        "production":"Some scientists have proposed Mesoamerica as a possible origin for the common bean. Scientists disagree over whether the common bean was a product of one or multiple domestication events. Over time two diverse gene pools emerged: the Andean gene pool from Southern Peru to Northwest Argentina and the Mesoamerican gene pool between Mexico and Colombia.[13]",
        "image1":"https://naturebring.com/wp-content/uploads/2019/02/Red-Kidney-beans22.jpg",
        "image2":"https://www.agrifarming.in/wp-content/uploads/2019/09/Comp1-20.jpg"
    },
    "Lentil":{
        "common name":"Many different names in different parts of the world are used for the crop lentil.[1] The first use of the word lens to designate a specific genus was in the 16th century by the botanist Tournefort.[2] The word lens for the lentil is of classical Roman/Latin origin: McGee points out that a prominent Roman family took the name Lentulus, just as the family name Cicero was derived from the chickpea, Cicer arietinum, or Fabia (as in Quintus Fabius Maximus) from the fava bean (Vicia faba).",
        "description1":" It is one of the most important protein rich pulse crop. It is mostly eaten as Dal by splitting into 2 cotyledons, deep orange red or orange yellow in color. Whole grain is also used in various dishes. Lentil also provide a source of starch for textiles and printing. It is mixed with wheat flour in bread and cake production. India is the highest producer of lentil in the world.",
        "plant":"A legume is a plant in the family Fabaceae (or Leguminosae), or the fruit or seed of such a plant ... Grain legumes include beans, lentils, lupins, peas, and peanuts​. Legumes are used as a key ingredient in vegan meat and dairy substitutes",
        "fruit":" It is about 40 cm (16 in) tall, and the seeds grow in pods, usually with two seeds in each. As a food crop, the majority of world production comes from Canada and India, producing 58% combined of the world total.",
        "cultivation":" In case of light soils, less tillage or soil manipulation is required to prepare seed-bed. One deep ploughing followed by 3-4 cross harrowing’s should be given in case of heavy soils. 2-3 ploughings are sufficient for proper pulverization of land. Levelling of field should also be done for proper distribution of water. Proper moisture should be present in the field at the time of sowing seeds.",
        "production":"In 2018, global production of lentils was 6.3 million tonnes, led by Canada with 33% and India with 25% of the world total (table).[8] Saskatchewan is the most productive growing region in Canada, producing 95% of the national total.[9][10] In India, Madhya Pradesh and Uttar Pradesh are largest producers with both producing more than 70 percent of the total. Other major producers include West Bengal and Bihar.",
        "image1":"https://lh3.googleusercontent.com/proxy/SRp4XzlWF9cJGjzW5i-u-oVYZs_anTGARPMQbmjkhR9pMy5bEcxaqN01AauN7kbdfL-rTSxu33j702lspJy8iyS8lDOkxSBNGMedloDlNgWIo414QQdKl1wp2KXZNEETGYHgJ0B3xoKWImQgDJgl4FHnf6c",
        "image2":"https://www.nature-and-garden.com/wp-content/uploads/sites/4/2018/02/lentille.jpg"
    },
    "Moth Beans":{
        "common name":"Vigna aconitifolia is a drought-resistant legume, commonly grown in arid and semi-arid regions of India. It is commonly called mat bean, moth bean, matki or dew bean",
        "description1":"Moth bean is a creeping annual herbaceous plant which grows to approximately 40 cm high. Yellow flowers on its hairy and densely packed branches develop into yellow-brown pods, 2 to 3 inches in length[1] The seeds of these pods contain approximately 22–24% protein.Due to its drought-resistant qualities, its ability to combat soil erosion and its high protein content, moth bean has been identified as possibly a more significant food source in the future.[3] It has been suggested that its suitability as a grain legume in semi-arid Africa should be further investigated.Belonging to the family Fabaceae (subfamily Papilionaceae), the moth bean is an herbaceous creeping annual that creates a low-lying soil cover when fully grown.[4] Its stem can grow up to 40 cm in height, with its hairy and dense-packed branches reaching a span of up to 150 cm.[1] Yellow flowers develop into a brown pod 2.5 to 5 cm in length, which holds 4 to 9 seeds inside.[1] The rectangular seeds exist in a variety of colours including yellow-brown, whitish-green, and mottled with black.",
        "plant":"Belonging to the family Fabaceae (subfamily Papilionaceae), the moth bean is an herbaceous creeping annual that creates a low-lying soil cover when fully grown.[4] Its stem can grow up to 40 cm in height, with its hairy and dense-packed branches reaching a span of up to 150 cm.[1] Yellow flowers develop into a brown pod 2.5 to 5 cm in length, which holds 4 to 9 seeds inside.[1] The rectangular seeds exist in a variety of colours including yellow-brown, whitish-green, and mottled with blac",
        "fruit":". The fruit is a hairy, brown or pale grey cylindrical pod, 2.5-5 cm long x 0.5 cm broad. It contains 4-9-(10) rectangular to cylindrical seeds (3-5 mm x 1.5-2.5 mm). The seeds are whitish green, yellow to brown in colour, often mottled. The 1000-seed weight is 10–35 g ",
        "cultivation":"Moth bean, a short-day crop, is one of the most drought-resistant pulses in India. Grown at altitudes up to 1300 m above sea level, it has a wide pH range (3.5–10) and can tolerate slight salinity.[1] While dry sandy soil is most suitable for production, moth bean can tolerate a variety of soil types.[1] The low-lying soil cover the crop creates helps prevent soil erosion by preventing moisture loss.Optimum production of moth bean occurs between 24–32 °C, but has been shown to tolerate up to 45 °C during the day",
        "production":"Moth bean is native to India , grown for food production and as a forage and cover crop.[3] It is predominately grown in India, although it has been cultivated in the United States, Australia, Thailand and other parts of Asia.[1][5] 1.5 million hectares of land is used in India for moth bean production, producing approximately 0.4 million t/ha of seeds. While its presence in Sudan, Somalia and other tropical countries of Africa has been noted, it has not been a crop of great importance to this region. The potential of increased production in this region in the future has been suggested.[",
        "image1":"https://www.feedipedia.org/sites/default/files/images/Vigna-aconitifolia_leaves%26flowers-MJussoorie%20Chakrata%20road%20near%20Bharatkhai-1-DSC09876.jpg",
        "image2":"https://5.imimg.com/data5/SELLER/Default/2020/9/WB/TK/QU/106270270/turkish-gram-moth-bean-500x500.jpg"
    },
    "Mung Bean":{
        "common name":"Mung bean, mungbean, moong bean, golden gram, green gram, celera bean, Jerusalem pea [English]; ambérique verte, haricot mungo [French]; frijol mungo, judía mungo, poroto chino [Spanish]; feijão-da-china, feijão-mungo [Portuguese]; mungboon [Dutch]; Mungbohne, Jerusalembohne [German]; kacang hijau [Indonesian]; kacang ijo [Javanese]; fagiolo indiano verde, fagiolo mungo verde [Italian]; monggo, munggo [Tagalog]; Đậu xanh [Vietnamese]; بقلة الماش [Arabic]; 绿豆 [Chinese]; મગ [Gujarati]; מש , שעועית מונג [Hebrew]; मूँग [Hindi]; ヤエナリ, リョクトウ [Japanese]; 녹두 [Korean]; ചെറുപയർ [Malayalam]; मूग [Marathi]; ماش [Persian]; Бобы мунг [Russian]; பாசிப் பயறு [Tamil]; పెసలు [Telugu]; ถั่วเขียว [Thai]",
        "description1":"The mung bean (Vigna radiata (L.) R. Wilczek) is a legume cultivated for its edible seeds and sprouts across Asia. There are 3 subgroups of Vigna radiata: one is cultivated (Vigna radiata subsp. radiata), and two are wild (Vigna radiata subsp. sublobata and Vigna radiata subsp. glabra).",
        "plant":"The mung bean plant is an annual, erect or semi-erect, reaching a height of 0.15-1.25 m (FAO, 2012; Lambrides et al., 2006; Mogotsi, 2006). It is slightly hairy with a well-developed root system. Wild types tend to be prostrate while cultivated types are more erect (Lambrides et al., 2006). The stems are many-branched, sometimes twining at the tips (Mogotsi, 2006). The leaves are alternate, trifoliolate with elliptical to ovate leaflets, 5-18 cm long x 3-15 cm broad. The flowers (4-30) are papillonaceous, pale yellow or greenish in colour. The pods are long, cylindrical, hairy and pending. They contain 7 to 20 small, ellipsoid or cube-shaped seeds. ",
        "fruit":"The seeds are variable in colour: they are usually green, but can also be yellow, olive, brown, purplish brown or black, mottled and/or ridged. Seed colours and presence or absence of a rough layer are used to distinguish different types of mung bean (Lambrides et al., 2006; Mogotsi, 2006). Cultivated types are generally green or golden and can be shiny or dull depending on the presence of a texture layer (Lambrides et al., 2006). Golden gram, which has yellow seeds",
        "cultivation":"Seeds should be planted 1 1/2 deep in a well prepared seedbed with a good moisture content. If the surface layers are dry this depth can be increased to 3 if the soil type is one which does not crust easily. The seedlings of mungbean can have a hard time breaking through a thick crust and stands will be reduced.",
        "production":"The mung bean is a major edible legume seed in Asia (India, South East-Asia and East Asia) and is also eaten in Southern Europe and in the Southern USA. The mature seeds provide an invaluable source of digestible protein for humans in places where meat is lacking or where people are mostly vegetarian (AVRDC, 2012)",
        "image1":"https://gcs-wp-assets.s3.amazonaws.com/2017/04/07085503/mung-bean.jpg",
        "image2":"https://gardeningtips.in/wp-content/uploads/2019/06/YawMMp1I.jpg"
    },
    "Peas":{
        "common name":"Pea, field pea, feed pea, protein pea [English]; pois, pois protéagineux [French]; guisante, chícharo, arveja [Spanish]; ervilha [Portuguese]; erwt [Dutch]; ercis katiang, ercis [Indonesian]; pisello [Italian]; tsitsaro [Tagalog]; bezelye [Turkish]; Đậu Hà Lan [Vietnamese]; البازلاء [Arabic]; 豌豆 [Chinese]; אפונה [Hebrew]; मटर [Hindi]; エンドウ[Japanese]; ถั่วลันเตา [Thai]; Горо́х [Russian]",
        "description1":"Peas (usually Pisum sativum L.) are one of the four most important legume crops next to soybean, groundnut, and beans. It is a particularly important legume grain in temperate areas with numerous food (dry seed, vegetable) and feed (seed, fodder) usages (Muehlbauer et al., 1997).",
        "plant":"The plant has a tap root that can grow as deep as 1 m, with numerous lateral roots. Leaves are alternate, compound with 1-3 pairs of leaflets borne on petioles with several pairs of tendrils. Large (up to 10 cm long) leaf-like stipules are inserted at the base of the leaves (FAO, 2011; Muehlbauer et al., 1997; Oelke et al., 1991). The inflorescence is a raceme that bears white, pink or purple flowers. The colour of the flower is an indicator of tannin content in the seed: white-flowered peas produce tannin-free seeds",
        "fruit":"Seeds can be green, yellow or pale green, brown or mottled, thin- or thick-hulled, smooth or wrinkled, of varying shape and size. Some varieties are tannin-free and pea breeding offers a large opportunity to improve the nutritional characteristics of the grain",
        "cultivation":"The seeds may be planted as soon as the soil temperature reaches 10 °C (50 °F), with the plants growing best at temperatures of 13 to 18 °C (55 to 64 °F). They do not thrive in the summer heat of warmer temperate and lowland tropical climates, but do grow well in cooler, high-altitude, tropical areas. Many cultivars reach maturity about 60 days after planting",
        "production":"The major producing countries of field peas are Russia and China, followed by Canada, Europe, Australia and the United States. Europe, Australia, Canada and the United States raise over 4.5 million acres and are major exporters of peas.",
        "image1":"https://images.saymedia-content.com/.image/t_share/MTc0MzUzODA4OTU1MzUyNzEw/-how-to-grow-your-own-peas-in-a-small-garden-gardening-tips-advice-growing-vegetables.jpg",
        "image2":"https://www.almanac.com/sites/default/files/styles/primary_image_in_article/public/image_nodes/peas-and-pea-pods.jpg?itok=trD6N79A"

    },
    "Pigeon Peas":{
        "common name":"Pigeon pea, no-eye pea, no-eyed pea, tropical green pea, cajan pea [English]; pois d'Angole, pois cajan, pois-congo, ambrevade [French]; guandú, gandul, guandul, frijol de palo, quinchoncho [Spanish]; guandu, andu, anduzeiro, guandeiro, feijão boer [Portuguese]; Straucherbse [German]; pwa kongo [Haitian creole]; gude, kacang gude [Indonesian]; caiano [Italian]; umukunde [Kinyarwanda]; pī kula [Tongan]; Đậu triều [Vietnamese]; 木豆 [Chinese]; તુવર [Gujarati]; अरहर दाल [Hindi]; キマメ [Japanese]; نخود کفتری [Persian]; Голубиный горох [Russian]; துவரை [Tamil]",
        "description1":"Pigeon pea (Cajanus cajan (L.) Huth) is one of the most common tropical and subtropical legumes cultivated for its edible seeds. Pigeon pea is fast growing, hardy, widely adaptable, and drought resistant (Bekele-Tessema, 2007). Because of its drought resistance it can be considered of the utmost importance for food security in regions where rainfall is unreliable and droughts are prone to occur",
        "plant":"Pigeonpea, Cajanus cajan, is a perennial shrub in the family Fabaceae grown for its edible pods and seeds. Pigeonpea is a highly branched shrub with a woody base, slender stems and trifoliate leaves. The plant leaflets are oblong or elliptical in shape and the leaves are alternate and arranged spirally on the stems. The plant usually produces yellow flowers, but they can be yellow with streaks of purple or red. The flowers are produced on racemes of 5–10 flowers.",
        "fruit":"The fruit of Cajanus cajan is a flat, straight, pubescent pod, 5-9 cm long x 12-13 mm wide. It contains 2-9 seeds that are brown, red or black in colour, small and sometimes hard-coated (FAO, 2016a; Bekele-Tessema, 2007).",
        "cultivation":"It is very heat-tolerant and grows better in places where temperatures range from 20° to 40°C and that are deprived of frost (FAO, 2016a). Though sensitive to frost, pigeon pea keeps growing at temperatures close to 0°C and tall plants can survive light frost. It does better where annual rainfall is above 625 mm. However, it is highly tolerant of dry periods and, where the soil is deep and well-structured, it continues growing with rainfall as low as 250 to 375 mm. Pigeon pea can grow on a wide range of soils, from sands to heavy black clays, with variable pH. However, the best pH range is within 5-7",
        "production":"Pigeon pea is a prolific seed producer: yields vary from 0.5 to 2 t/ha (Ecocrop, 2016). In Kenya, yields of about 1 t/ha were reported (OAF, 2015). Under the harsh conditions of the South Sahel, only 650 kg of beans were produced for human consumption (FAO, 2016a). Under optimal conditions, in sole cropping, seed yields were reported to be as high as 5 t/ha in India, and about 3-4 t/ha in Indonesia (van der Maesen, 1989). In Asia, in marginal areas, yields were 700 kg/ha with sole cropping,",
        "image1":"https://www.tropicalpermaculture.com/images/pigeon-pea7.jpg",
        "image2":"https://sites.google.com/site/knowyourvegetables/_/rsrc/1286580596526/know-your-peas/know-your-pigeon-pea/Pigen%20pea%2001.jpg?height=234&width=400"
    },
    "Rubber":{
        "common name":"Hevea, Para rubber tree, sharinga tree, rubber tree [English]; siringa, jebe [Spanish]; seringueira, seringueira-branca, pau-seringa, seringueira-rosada, seringueira-verdadeira [Portuguese]; hévéa, arbre de Para, arbre à caoutchouc [French]; Braziliaanse rubberboom [Dutch]; pohon karet para [Indonesian]; albero della gomma [Italian]; pokok getah [Malay]; tuwuhan karét [Sundanese]; cây cao su [Vietnamese]; 橡膠樹 [Chinese]; रबड़ [Hindi]; 파라고무나무 [Korean]; റബ്ബർ മരം [Malayalam]; درخت لاستیک [Persian]; రబ్బరు చెట్టు [Telugu]; ยางพารา [Thai]",
        "description1":"Currently, rubber is harvested mainly in the form of the latex from the rubber tree (Hevea brasiliensis) or others. The latex is a sticky, milky and white colloid drawn off by making incisions in the bark and collecting the fluid in vessels in a process called tapping. The latex then is refined into rubber that is ready for commercial processing. In major areas, latex is allowed to coagulate in the collection cup. The coagulated lumps are collected and processed into dry forms for sale.",
        "plant":"The rubber tree (Hevea brasiliensis) is a fast growing, medium to tall tree (25 m high in plantations and up to 40 m in the wild), with deep tap-roots. The trunk is smooth and straight with a grayish bark. It is known for its laticiferous system from which latex is extracted by tapping the trunk. Leaves are trifoliate, 10 to 15 cm long and 3 to 6 cm broad. Flowers are monoecious and borne in panicles with apical flowers being female and lateral ones male",
        "fruit":"The rubber tree starts bearing fruit at four years of age. Each fruit contains three or four seeds, which fall to the ground when the fruit ripens and splits. Each tree yields about 800 seeds (1.3 kg) twice a year. The seed consists of a thin hard shell and a kernel containing oil used in various industries. The kernel and the shell are sometimes extracted together, yielding an undecorticated oilcake or meal with a very high fibre content.",
        "cultivation":"Rubber grows best between 15°N and 10°S and from sea level up to 600 m, with the optimal altitude being below 200 m (Ecocrop, 2009). It is not very tolerant to soil erosion on hillslopes nor to strong winds. It performs well with a day temperature between 26 and 28°C, and with annual rainfall ranging from 2000 to 3000 mm. It can withstand drought and waterlogging for a while, but prefers well drained soils (Ghani et al., 2000) with good moisture storage capacity. It can grow on acidic soils, volcanic soils and even peaty soils (Orwa et al., 2009).",
        "production":"The rubber tree is native to the tropical rainforest of the Amazon basin and the Guianas (Ghani et al., 2000). It is widespread in the northern part of South America (Bolivia, Colombia, Peru) and was introduced into South-East Asia (95% of latex production is in this region) and to Africa.",
        "image1":"https://cdn.britannica.com/21/75921-050-A34DC6E2/Latex-rubber-tree.jpg",
        "image2":"https://gardenerspath.com/wp-content/uploads/2021/03/How-to-Grow-Rubber-Tree-FB.jpg"
    },
    "SugarCane":{
        "common name":"Sugarcane or sugar cane refers to several species and hybrids of tall perennial grass in the genus Saccharum, tribe Andropogoneae",
        "description1":"ucrose (table sugar) is extracted from sugarcane in specialized mill factories. It is consumed directly in confectionery, used to sweeten beverages, as a preservative in jams and conserves, as a decorative finish for cakes and pâtisserie, as a raw material in the food industry, or fermented to produce ethanol. Products derived from fermentation of sugar include falernum, rum, and cachaça. In some regions, people use sugarcane reeds to make pens, mats, screens, and thatch. The young, unexpanded flower head of Saccharum edule (duruka) is eaten raw, steamed, or toasted, and prepared in various ways in Southeast Asia, including Fiji and certain island communities of Indonesia",
        "plant":"The plants are 2-6 m (6-20 ft) tall with stout, jointed, fibrous stalks that are rich in sucrose, which accumulates in the stalk internodes. Sugarcanes belong to the grass family, Poaceae, an economically important flowering plant family that includes maize, wheat, rice, and sorghum, and many forage crops",
        "cultivation":"The stems grow into cane stalk, which when mature, constitutes around 75% of the entire plant. A mature stalk is typically composed of 11–16% fiber, 12–16% soluble sugars, 2–3% nonsugar carbohydrates, and 63–73% water. A sugarcane crop is sensitive to climate, soil type, irrigation, fertilizers, insects, disease control, varieties, and the harvest period.",
        "production":"Global production of sugarcane in 2018 was 1.91 billion tonnes, with Brazil producing 39% of the world total, India with 20%, and China and Thailand producing about 6% each",
        "image1":"https://cdn.sei.org/wp-content/uploads/2021/02/rsz-1cane-farmer-1-mta-2364x1576.jpg",
        "image2":"https://www.gardeningknowhow.com/wp-content/uploads/2018/06/sugarcane-use.jpg"
    },
    "Tea":{
        "common name":"Tea • Hindi: चाय Chaay • Manipuri: চা Cha • Tamil: தேய் Tey • Malayalam: Tey • Telugu: Teyaku • Kannada: ತೇ Tea, ಚಹ Chaha, ಚಹಾ Chahaa, ಚಾ Chaa • Bengali: চা Cha • Urdu: چاے Chaay • Assamese: চা Cha • Sanskrit: Syamaparni • Nepali: चिया Chiyaa • Mizo: Thingpui",
        "description1":"Tea is an aromatic beverage prepared by pouring hot or boiling water over cured or fresh leaves of Camellia sinensis, an evergreen shrub native to China and East Asia.[3] After water, it is the most widely consumed drink in the world.[4] There are many different types of tea; some, like Chinese greens and Darjeeling, have a cooling, slightly bitter, and astringent flavour,[5] while others have vastly different profiles that include sweet, nutty, floral, or grassy notes. Tea has a stimulating effect in humans primarily due to its caffeine content.[6]",
        "plant":"A tea plant will grow into a tree of up to 16 m (52 ft) if left undisturbed,[51] but cultivated plants are generally pruned to waist height for ease of plucking. Also, the short plants bear more new shoots which provide new and tender leaves and increase the quality of the tea.[64] Only the top 2.5–5 centimetres (1–2 in) of the mature plant are picked.",
        "cultivation":"climate or warmer, tea plants require at least 127 cm (50 in) of rainfall per year and prefer acidic soils.[59] Many high-quality tea plants are cultivated at elevations of up to 1,500 m (4,900 ft) above sea level. Though at these heights the plants grow more slowly, they acquire a better flavour",
        "production":"In 2019, global production of tea was 6.5 million tonnes, led by China with 43% and India with 22% of the world total. Kenya, Sri Lanka, and Vietnam were secondary producers",
        "image1":"https://www.thespruce.com/thmb/VhmbqPQHhYQ-6UafF12QbD_0hXg=/4357x2907/filters:no_upscale():max_bytes(150000):strip_icc()/camellia-sinensis-definition-765682-03-f7ec65cbb2994112a10cff91e2e0f3f2.jpg",
        "image2":"https://kj1bcdn.b-cdn.net/media/19673/tea-plant-and-tea.jpg"
    },
    "Tobacco":{
        "common name":" Tobacco • Hindi: तम्बाकू Tambaku •  Hidakmana • Mizo: Vaihlo • Kannada: ಹೊಗೆಸೊಪ್ಪು Hogesoppu, ತಂಬಾಕು Tambaaku,Tobacco is the common name of several plants in the Nicotiana genus and the Solanaceae (nightshade) family, and the general term for any product prepared from the cured leaves of the tobacco plant.",
        "description1":"Dried tobacco leaves are mainly used for smoking in cigarettes and cigars, as well as pipes and shishas. They can also be consumed as snuff, chewing tobacco, dipping tobacco and snus.Tobacco contains the highly addictive stimulant alkaloid nicotine as well as harmala alkaloids.[3] Tobacco use is a cause or risk factor for many deadly diseases; especially those affecting the heart, liver, and lungs, as well as many cancers. In 2008, the World Health Organization named tobacco use as the world's single greatest preventable cause of death",
        "plant":"The tobacco plant has a thick, hairy stem and large, simple leaves which are oval in shape. The tobacco plant produces white, cream, pink or red flowers which grow in large clusters, are tubular in appearance and can reach 3.5-5.5 cm (1,25-2 in) in length.",
        "cultivation": "Though tobacco is tropical in origin, it is grown throughout the world. Cultivated tobacco (N. tabacum) requires a frost-free period of 100 to 130 days from date of transplanting to maturity in the field. Aztec tobacco (N. rustica), which is grown to some extent in India, Vietnam, and certain Transcaucasian countries, matures more quickly and is more potent than cultivated tobacco.",
        "production":"Production of tobacco leaf increased by 40% between 1971, when 4.2 million tons of leaf were produced, and 1997, when 5.9 million tons of leaf were produced.[36] According to the Food and Agriculture organization of the UN, tobacco leaf production was expected to hit 7.1 million tons by 2010.",
        "image1":"https://cdn.the-scientist.com/assets/articleNo/65286/aImg/30158/tobacco-plants-l.jpg",
        "image2":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/DunhillLightFlake.jpg/1200px-DunhillLightFlake.jpg"
    },
    "apple":{
        "common name":"An apple is an edible fruit produced by an apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek, and European Christian tradition.",
        "description1":"The apple is a deciduous tree, generally standing 2 to 4.5 m (6 to 15 ft) tall in cultivation and up to 9 m (30 ft) in the wild. When cultivated, the size, shape and branch density are determined by rootstock selection and trimming method. The leaves are alternately arranged dark green-colored simple ovals with serrated margins and slightly downy underside",
        "plant":"Apple trees are small to medium sized trees reaching heights of 5–10 m (16.4–32.8 ft), with a central trunk which divides into several branches. The leaves of the tree are oval in shape and can reach up to 13 cm (5.1 in) in length and 7 cm (2.8 in) in width.",
        "fruit":"The fruit matures in late summer or autumn, and cultivars exist in a wide range of sizes. Commercial growers aim to produce an apple that is 7 to 8.5 cm (2+3⁄4 to 3+1⁄4 in) in diameter, due to market preference. Some consumers, especially those in Japan, prefer a larger apple, while apples below 5.5 cm (2+1⁄4 in) are generally used for making juice and have little fresh market value. The skin of ripe apples is generally red, yellow, green, pink, or russetted, though many bi- or tri-colored cultivars may be found.[7] The skin may also be wholly or partly russeted i.e. rough and brown. The skin is covered in a protective layer of epicuticular wax.[8] The exocarp (flesh) is generally pale yellowish-white,[7] though pink or yellow exocarps also occur.",
        "cultivation":"Apples grow best on a well-drained, loam soils having a depth of 45 cm and a pH range of pH 5.5-6.5. The soil should be free from hard substrata and water-logged conditions. Soils with heavy clay or compact subsoil are to be avoided.",
        "production":"Worldwide 89,565,973 tonnes of apple is produced per year. China is the largest apple producer in the world with 44,448,575 tonnes production volume per year. ... China and United States of America produce together more than 50% of World's total. India is with 2,872,000 is ranked at 5.",
        "image1":"https://cdn.harvesttotable.com/htt/2009/07/23190753/Apple-tree-with-fruit1.jpg",
        "image2":"https://www.gardeningknowhow.com/wp-content/uploads/2020/11/red-apples.jpg"
    },
    "banana":{
        "common name":"Hindi: केला Kela • Kannada: ಬಾೞೆ Baazhe, ಬಾಳೆ, Baale • Malayalam: Vaazha • Manipuri: ꯂꯐꯨ ꯊꯔꯣ Laphoo tharo • Tamil: Vaazha வாழை • Nepali: केरा Kera • Telugu: అరటి Arati • Mizo: Balhlakual, Vaibalhla • Angami: Tekhusi • Sanskrit: कदली Kadalee, वारणबुसा Vaaranabusaa, रम्भा rambhaa, मोचा Mochaa, अंशुमत्फला Amshumatphalaa",
        "description1":"A banana is an elongated, edible fruit – botanically a berry[1][2] – produced by several kinds of large herbaceous flowering plants in the genus Musa.[3] In some countries, bananas used for cooking may be called plantains, distinguishing them from dessert bananas. The fruit is variable in size, color, and firmness, but is usually elongated and curved, with soft flesh rich in starch covered with a rind, which may be green, yellow, red, purple, or brown when ripe. The fruits grow in clusters hanging from the top of the plant. Almost all modern edible seedless (parthenocarp) bananas come from two wild species – Musa acuminata and Musa balbisiana. The scientific names of most cultivated bananas are Musa acuminata",
        "plant":"The banana plant is a gigantic herb that springs from an underground stem, or rhizome, to form a false trunk 3–6 metres (10–20 feet) high. ... Each herbaceous trunk bears only one bunch of fruit and is cut down after harvest to encourage new growth from the rhizome (underground stem).",
        "fruit":"Fruit. The banana fruits grow from a banana blossom in hanging clusters, also called a bunch or banana stem. The fruits grow in rows called tiers or hands. There can be as many as twenty fruits to a hand, and as many as twenty tiers in a bunch.",
        "cultivation":"If your soil is poor, your tree may grow fine but not produce fruit. Your soil should be rich, non-saline, and have a pH between 5.5 and 7.0.Getting banana plants to fruit also requires continuous warmth. A banana plant can survive down to freezing, but it won’t grow or set fruit below 50 F. (10 C.). The ideal temperature for banana fruit set is in the mid 80’s.",
        "production":"Total annual world production is estimated at 86 million tonnes of fruits. India leads the world in banana production with an annual output of about 14.2 million tonnes. Other leading producers are Brazil, Eucador, China, Phillipines, Indonesia, Costarica, Mexico, Thailand and Colombia. ('000 Ha.)",
        "image1":"https://www.gardeningknowhow.com/wp-content/uploads/2020/11/red-apples.jpg",
        "image2":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT_MVRN1Mz6PyS6WbLveUvnuGic8sdX8emNSg&usqp=CAU"
    },
    "grapes":{
        "common name":"Grape Vine • Hindi: अंगूर Angoor • Manipuri: ꯑꯡꯒꯨꯔ Angur • Nepali: अंगुर Angur",
        "description1":"Grapes are a type of fruit that grow in clusters of 15 to 300, and can be crimson, black, dark blue, yellow, green, orange, and pink. White grapes are actually green in color, and are evolutionarily derived from the purple grape. Mutations in two regulatory genes of white grapes turn off production of anthocyanins, which are responsible for the color of purple grapes.[12] Anthocyanins and other pigment chemicals of the larger family of polyphenols in purple grapes are responsible for the varying shades of purple in red wines.[13][14] Grapes are typically an ellipsoid shape resembling a prolate spheroid.",
        "plant":"Grapevine is a perennial plant bush, characterized by helices – tendrils and trailing growth. It is a climbing plant and normally climbs on rocks or tree trunks. Tendrils grow on stems and are believed to be degenerated inflorescences. Leaves are big, opposite, heart resembled, and inflorescences grow across them",
        "fruit":"The grapefruit is a fruit with a spherical shape, slightly flattened, with a pale yellow or reddish smooth or rough skin. ... The flesh is yellow except in the reddish varieties, that range from pink to red and have a sweeter taste. Its English name, Grapefruit, makes reference to the fact that the fruits grow in clusters.",
        "cultivation":"Sandy to clayey and loamy soil with good drainage and irrigation facilities is suitable for the cultivation of Grapes. Soils having pH value from 6.5 to 7.5 are most suitable.In its natural habitat, the crop bears fruit during the hot and dry period and undergoes dormancy during the period of severe cold. It tolerates frost during resting stage but is very susceptible during growing period. Temperature ranging from 15-350 C is ideal for shoot growth and normal physiological processes of the grapevine. Vines do not grow and fruit well when the temperature falls below 100 C.",
        "production":"India is among the first ten countries in the world in the production of grape. The major producers of grape are Italy, France, Spain, USA, Turkey, China and Argentina.  This crop occupies fifth position amongst fruit crops in India with a production of 1.21 million tonnes (around 2% of world’s production of 57.40 million tonnes) from an area of 0.05 million ha. in 2001-02. The area under grape is 1.2 % of the total area of fruit crops in the country.  Production is 2.8% of total fruits produced in the country. About 80% of the production comes from Maharashtra followed by Karnataka and Tamil Nadu.",
        "image1":"https://www.almanac.com/sites/default/files/image_nodes/green-grapes.jpg",
        "image2":"https://www.aicr.org/wp-content/uploads/2020/01/shutterstock_533487490-640x462.jpg"
    },
    "maize":{
        "common name":": Maize, Corn • Hindi: मक्का Makka, मकई Makai, भुट्टा Bhutta • Manipuri: চুজাক Chujak • Marathi: भुट्टा Bhutta • Tamil: மக்கா சொலம் Makka cholam • Malayalam: മക്കാ ചൊലമ് Makka cholam • Telugu: Mokka javanalu • Kannada: Makkejola • Konkani: Mako • Urdu: Makka مککا • Mizo: Vaimim • Angami: Shuko",
        "description1":"Maize or Indian corn (called corn in some countries) is Zea mays, a member of the grass family Poaceae. It is a cereal grain which was first grown by people in ancient Central America. Approximately 1 billion tonnes are harvested every year. However, little of this maize is eaten directly by humans.",
        "plant":"Maize, Zea mays, is an annual grass in the family Poaceae and is a staple food crop grown all over the world. The maize plant possesses a simple stem of nodes and internodes. A pair of large leaves extend off of each internode and the leaves total 8–21 per plant.",
        "fruit":"The pericarp of the fruit is fused with the seed coat referred to as caryopsis, typical of the grasses, and the entire kernel is often referred to as the seed. The cob is close to a multiple fruit in structure, except that the individual fruits (the kernels) never fuse into a single mass.",
        "cultivation":"Because it is cold-intolerant, in the temperate zones maize must be planted in the spring. Its root system is generally shallow, so the plant is dependent on soil moisture. As a plant that uses C4 carbon fixation, maize is a considerably more water-efficient crop than plants that use C3 carbon fixation such as alfalfa and soybeans. Maize is most sensitive to drought at the time of silk emergence, when the flowers are ready for pollination. In the United States, a good harvest was traditionally predicted if the maize was knee-high by the Fourth of July, although modern hybrids generally exceed this growth rate",
        "production":"The predominant maize growing states that contributes more than 80 % of the total maize production are Andhra Pradesh (20.9 %), Karnataka (16.5 %), Rajasthan (9.9 %), Maharashtra (9.1 %), Bihar (8.9 %), Uttar Pradesh (6.1 %), Madhya Pradesh (5.7 %), Himachal Pradesh (4.4 %).",
        "image1":"https://cdn.harvesttotable.com/htt/2009/03/23181419/canstockphoto13707778-1024x683.jpg",
        "image2":"https://www.mccormick.it/wp-content/uploads/2020/05/dati-aggiornati-sulla-produzione-di-mais-nel-mondo-853x480.jpg"
    },
    "mango":{
        "common name":"Mango • Hindi: Am आम • Gujarati: Aambo આંબો • Manipuri: ꯍꯩꯅꯧ Heinou • Tamil: மா Ma • Telugu: Mamidi • Malayalam: Mangga • Kannada: ಮಾ Maa, ಮಾವು Maavu, ಮಾವಿನ ಮರ Maavina mara • Marathi: Amba अंबा • Konkani: Ambo आंबॉ • Mizo: Theihai • Angami: Merosi",
        "description1":"Mango trees grow to 30–40 m (98–131 ft) tall, with a crown radius of 10–15 m (33–49 ft). The trees are long-lived, as some specimens still fruit after 300 years.[9] In deep soil, the taproot descends to a depth of 6 m (20 ft), with profuse, wide-spreading feeder roots and anchor roots penetrating deeply into the soil",
        "plant":"Mango, Mangifera indica, is an evergreen tree in the family Anacardiaceae grown for its edible fruit. The mango tree is erect and branching with a thick trunk and broad, rounded canopy. The leaves of the tree are are shiny and dark green. ... The fruit is a drupe, with an outer flesh surrounding a stone.",
        "fruit":"The ripe fruit varies according to cultivar in size, shape, color, sweetness, and eating quality.[4] Depending on cultivar, fruits are variously yellow, orange, red, or green.[4] The fruit has a single flat, oblong pit that can be fibrous or hairy on the surface, and does not separate easily from the pulp.[4] The fruits may be somewhat round, oval, or kidney-shaped, ranging from 5–25 centimetres (2–10 in) in length and from 140 grams (5 oz) to 2 kilograms (5 lb) in weight per individual fruit.[4] The skin is leather-like, waxy, smooth, and fragrant, with color ranging from green to yellow, yellow-orange, yellow-red, or blushed with various shades of red, purple, pink or yellow when fully ripe",
        "cultivation":"Mango has been found to grow on a wide range of soils. However, deep and well-drained loam to sandy loam soils are most suitable for cultivation. Heavy black cotton, saline and alkaline soils should be avoided. The deal range of soil pH for mango cultivation is 5.5 to 7.5.",
        "production":"Mango (Mangifera indica) is the leading fruit crop of India and considered to ... Although, India is the largest mango producing country, accounting about 45% of 10 pages",
        "image1":"https://5.imimg.com/data5/QN/NV/MY-7435462/dussehri-mango-plant-500x500.jpg",
        "image2":"https://images.livemint.com/rf/Image-621x414/LiveMint/Period2/2018/05/05/Photos/Processed/mangoes1-k22F--621x414@LiveMint.jpg"
    },
    "millet":{
        "common name":"millets pearl millet (bajra), foxtail millet (kangni), sorghum (jowar), finger millet (ragi)",
        "description1":"Millets (/ˈmɪlɪts/) are a group of highly variable small-seeded grasses, widely grown around the world as cereal crops or grains for fodder and human food. ... The crop is favored due to its productivity and short growing season under dry, high-temperature conditions. Millets are indigenous to many parts of the world.",
        "plant":"Millet is an annual plant of the grass family Gramineae or Poaceae  with fine and long stem  measuring from half a meter to nearly 2 meters high. They are covered by fuzzy-like filaments a few millimeters thick",
        "fruit":"within the spikes we find the seeds or grains we eat as a cereal. They show different colors and are surrounded by bracts. Their size varies depending on the different varietes, but they are about 3 millimeters fruit is a small grain seed with yellowish appearance, which is edible",
        "cultivation":"The forage types are much taller (7 to 8 feet) and have a small seed yield. Soil temperatures should be at least 65°F., and rather warmer before pearl millet is planted. In optimum planting time is early June, with a range of mid-May to mid-June being suitable. The seeding rate is recommended at four pounds per acre",
        "production":"In 2016, global production of millet was 28.4 million tonnes, led by India with 36% of the world total (table). Niger also had significant production.",
        "image1":"https://farmhouse-bc.com/wp-content/uploads/Growing-Millet-for-Birds-1.jpg",
        "image2":"https://cdn-a.william-reed.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/bakeryandsnacks.com/article/2018/12/11/call-to-action-fao-places-nutrient-rich-millets-center-stage-to-boost-global-innovation/8934242-1-eng-GB/Call-to-action-FAO-places-nutrient-rich-millets-center-stage-to-boost-global-innovation_wrbm_large.jpg"
    },
    "muskmelon":{
        "common name":" Melon, Muskmelon, Cantaloupe, Honeydew, Sugar melon • Hindi: खरबूज़ा Kharbooza • Marathi: चिबुंडा Chibunda, Tarkaddi • Tamil: Thumattikai • Kannada: Budame Kayi • Bengali: Kharmuj • Urdu: Kharbooza • Gujarati: તરબૂચા Tarbucha • Sanskrit: मधुफल Madhuphala, व्रट्टकर्कटी Vrittakarkatii • Mizo: Hma-zil",
        "description1":"Musk melon, is a species of Cucumis that has been developed into many cultivated varieties. The fruit is a pepo. The flesh is either sweet or bland, with or without a musky aroma, and the rind can be smooth (such as honeydew), ribbed (such as cantaloupe), wrinkled (such as casaba melon), or netted (such as muskmelon). In North America, the sweet-flesh varieties are often collectively called muskmelon, including the musky netted-rind varieties and the inodorous smooth-rind varieties",
        "plant":"Muskmelons (Cucumis melo). Like all melons, muskmelons are annual vines that require a long warm growing season. They have hairy trailing stems with clasping tendrils and bear round to lobed leaves. The yellow unisexual flowers produce large fruits, which give off a sweet odour when ripe.",
        "fruit":"Muskmelon, also called nutmeg melon, any of several varieties of netted-rind melons in the gourd family (Cucurbitaceae), noted for their musky-scented sweet juicy orange flesh. Muskmelons are among the most-important commercial melons and are commonly eaten fresh.",
        "cultivation":" The Cantaloupe/Muskmelon crop grows best in hot and dry climatic conditions and this fruit is cultivated as summer crop. Good sunshine and high heat make the melon to have good sugar content. This fruit crop is highly susceptible to frost conditions.",
        "production":" important producing countries are Turkey, USA, Spain, Romania, Morocco, India, Mexico, and Egypt. The mature fruits of the orange-fleshed melons rank",
        "image1":"https://i.ytimg.com/vi/DvvYQc8N1QI/maxresdefault.jpg",
        "image2":"https://www.thespruce.com/thmb/zig0sYlEwlT4P6YI3wUPy8LgmOQ=/450x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1221148847-88e91020e8f3402580abcfea01e090f1.jpg"
    },
    "papaya":{
        "common name":"Papaya, Melon tree, Pawpaw, papaya, Tree melon • Hindi: पपीता Papita • Manipuri: ꯑꯋꯥꯊꯕꯤ Awathabi • Marathi: पपयी Pappayi, पोपय Popay • Tamil: பப்பாளி pappALi • Bengali: Papeya • Konkani: पॉप्पाइ poppayi • Sanskrit: एरण्ड कर्कटी Erand karkati • Mizo: Thing-fanghma • Kannada: ಪಪ್ಪಾಯ Pappaaya, ಪಪ್ಪಾಯಿ Pappaayi, ಪರಂಗಿ Parangi",
        "description1":"Papaya is a soft tropical fruit with a yellowish-orange color. This species of fruit — which belongs to the Caricaceae family — is round and plump and comes in larger and smaller sizes Its taste depends on whether you’re eating ripe or unripe papaya. When ripe, papaya is sweet and has a flavor comparable to a melon. Unripe papaya, on the other hand, may have little to no flavor.",
        "plant":"The papaya plant is considered a tree, though its palmlike trunk, up to 8 metres (26 feet) tall, is not as woody as the designation generally implies. The plant is crowned by deeply lobed leaves, sometimes 60 cm (2 feet) across, borne on hollow petioles (leaf stalks) 60 cm long.plants can be male, female, and hermaphrodite",
        "fruit":"The papaya fruit is slightly sweet, with an agreeable musky tang, which is more pronounced in some varieties and in some climates than in others. It is a popular breakfast fruit in many countries and is also used in salads, pies, sherbets, juices, and confections. The unripe fruit can be cooked like squash.",
        "cultivation":"Papaya is planted during spring (February-March), monsoon (June-July) and autumn (October-November). A spacing of 1.8 x 1.8 m. is normally followed. However higher density cultivation with spacing of 1.5 x 1.5 m./ha enhances the returns to the farmer and is recommended.",
        "production":"India leads the world in papaya production with an annual output of about 3 million tonnes. Other leading producers are Brazil, Mexico, Nigeria, Indonesia, China, Peru, Thailand and Philippines.",
        "image1":"https://www.garden.eco/wp-content/uploads/2018/07/papaya-tree-care.jpg",
        "image2":"https://images-prod.healthline.com/hlcmsresource/images/AN_images/papaya-benefits-1296x728-feature.jpg"
    },
    "orange":{
        "common name":"Sweet Orange • Hindi: माल्टा Malta, मौसम्बी Mosambi • Kannada: ಈಳೆ Eele, ಕಮಲಾಹಣ್ಣು Kamala hanuu, ಮೂಸಂಬಿ Moosambi ಸಾತಗಡಿ Saatagaḍi • Manipuri: ꯃꯨꯁꯝꯕꯤ Musambi • Nepali: मौसमी Mausami • Sanskrit: नागरंगा Nagaranga • Tamil: Charukkaraikkolumiccai, Charukkarainarattai • Telugu: బత్తాయి నారింజ battayi",
        "description1":"The orange is the fruit of various citrus species in the family Rutaceae (see list of plants known as orange); it primarily refers to Citrus × sinensis,[1] which is also called sweet orange, to distinguish it from the related Citrus × aurantium, referred to as bitter orange. The sweet orange reproduces asexually (apomixis through nucellar embryony); varieties of sweet orange arise through mutations",
        "plant":"Orange plant (Citrus x sinensis) belongs to the Rutaceae family. It is a flowering tree and its height in maturity can range between 16 and 50 ft. (between 5 and 15 m). Orange tree is grown mostly for its fruits, but also for its flowers and as an ornamental",
        "fruit":"Oranges are round orange-coloured fruit that grow on a tree which can reach 10 metres (33 ft) high. Orange trees have dark green shiny leaves and small white flowers with five petals. The flowers smell very sweet which attracts many bees. An orange has a tough shiny orange skin.",
        "cultivation":"Like most citrus plants, oranges do well under moderate temperatures—between 15.5 and 29 °C (59.9 and 84.2 °F)—and require considerable amounts of sunshine and water.Orange orchards are generally planted in relatively deep soil where drainage is good. The orange trees are usually budded on stocks grown from the seed of selected trees. The seeds are sown in well-prepared soil in a lath house; after about 12 months' growth there, the seedlings are removed to a nursery.",
        "production":"In 2019, world production of oranges was 79 million tonnes, led by Brazil with 22% of the total, followed by China, India, the United States, and Mexico as other major producers.In the United States, groves are located mainly in Florida, California, and Texas.[86] The majority of California's crop is sold as fresh fruit, whereas Florida's oranges are destined to juice products. The Indian River area of Florida is known for the high quality of its juice, which often is sold fresh in the United States",
        "image1":"https://i.guim.co.uk/img/media/e8d52b4756fa83b2082b31ee64185597a9997d9f/0_171_5130_3078/master/5130.jpg?width=1200&height=900&quality=85&auto=format&fit=crop&s=b7d113e77052ae98b77aaa3d3003af75",
        "image2":"https://assetscdn1.paytm.com/images/catalog/product/H/HO/HOMPLANT-HOUSE-PLAN996525B1A763A1/1576893952130_0..jpg?imwidth=320&impolicy=hq"
    },
    "pomegranate":{
        "common name":"Pomegranate, • Hindi: Anar अनार • Kannada: ದಾಳಿಂಬೆ Daalimbe, ದಾಳಿಂಬ Daalimba, ದಾಡಿಂಬೆ Daadimbe, ದಾಡಿಂಬ Daadimba, ದಾಡಿಮ Daadima • Manipuri: ꯀꯐꯣꯏ Kaphoi • Marathi: Dalimb डाळिंब • Mizo: Theibuhfai, Manding • Angami: Touram • Telugu: దానిమ్మ Danimma • Tamil: மாதுளை Madulai • Urdu: ﺍﻧﺎﺭ",
        "description1":"The pomegranate (Punica granatum) is a fruit-bearing deciduous shrub in the family Lythraceae, subfamily Punicoideae, that grows between 5 and 10 m (16 and 33 ft) tall. The pomegranate was originally described throughout the Mediterranean region. It was introduced into Spanish America in the late 16th century and into California by Spanish settlers in 1769.",
        "plant":"A shrub or small tree growing 5 to 10 m (16 to 33 ft) high, the pomegranate has multiple spiny branches and is extremely long-lived, with some specimens in France surviving for 200 years.[3] P. granatum leaves are opposite or subopposite, glossy, narrow oblong, entire, 3–7 cm (1+1⁄4–2+3⁄4 in) long and 2 cm (3⁄4 in) broad. The flowers are bright red and 3 cm (1+1⁄4 in) in diameter, with three to seven petals.[3] Some fruitless varieties are grown for the flowers alone",
        "fruit":"Red-purple in color, the pomegranate fruit husk has two parts: an outer, hard pericarp, and an inner, spongy mesocarp (white albedo), which comprises the fruit inner wall where seeds attach.[9] Membranes of the mesocarp are organized as nonsymmetric chambers that contain seeds inside sarcotestas, which are embedded without attachment to the mesocarp.[9] Containing juice, the sarcotesta is formed as a thin membrane derived from the epidermal cells of the seeds.",
        "cultivation":"P. granatum is grown for its fruit crop, and as ornamental trees and shrubs in parks and gardens. Mature specimens can develop sculptural twisted-bark multiple trunks and a distinctive overall form. Pomegranates are drought-tolerant, and can be grown in dry areas with either a Mediterranean winter rainfall climate or in summer rainfall climates. In wetter areas, they can be prone to root decay from fungal diseases. They can be tolerant of moderate frost, down to about −12 °C (10 °F)",
        "production":"At the global level, India is the world's largest producer of pomegranates, followed by Iran. Other countries like Turkey, Spain, Tunisia, Morocco, Afghanistan, China, Greece, Japan, France, Armenia, Cyprus, Egypt, Italy and Palestine also cultivate this fruit crop.",
        "image1":"https://www.researchgate.net/profile/Ibrahim-Kahramanoglu/publication/323683101/figure/fig1/AS:622969512525824@1525538914111/A-view-of-a-pomegranate-tree.png",
        "image2":"https://extension.usu.edu/preserve-the-harvest/images/pomegranate.jpg"
    },
    "rice":{
        "common name":" Rice, paddy, sake, sea-grass matting • Assamese: ধান Dhan • Bengali: ধান Dhan • Hindi: चावल Chaval • Kannada: akki, bhatta • Malayalam: ari, navaranellu, nellu • Manipuri: Phaou • Marathi: tandul, bhat, pendha • Oriya: dhano • Sanskrit: dhanya, dhanyah, garuda • Tamil: arishi, arisi, nellu • Telugu: biyam, biyyam, dhanyamu • Urdu: chawal • Mizo: Buh",
        "description1":"RICE is a mnemonic acronym for four elements of treatment for soft tissue injuries: rest, ice, compression, and elevation.[1][2][3] The mnemonic was introduced by Gabe Mirkin in 1978.[4] He has since recanted his support for the regimen. In 2014 he wrote, Coaches have used my 'RICE' guideline for decades, but now it appears that both ice and complete Rest may delay healing, instead of helping. In a recent study, athletes were told to exercise so intensely that they developed severe muscle damage that caused extensive muscle soreness. Although cooling delayed swelling, it did not hasten recovery from this muscle damage.",
        "plant":"The cultivated rice plant is an annual grass and grows to about 1.2 metres (4 feet) in height. The leaves are long and flattened and are borne on hollow stems. The fibrous root system is often broad and spreading. ... Ripening heads of rice",
        "fruit":"Each grain of rice is a fruit. The fruit of rice consists of two parts: the seed and fine dry husks.that produce the fruit, or grain. Varieties differ greatly in the length, shape, and weight of the panicle and the overall productivity of a given plan",
        "cultivation":"Rice can grow in either a wet (paddy) or a dry (field) setting. (Rice fields are also called paddy fields or rice paddies). About 75% of the global rice production comes from irrigated rice systems because most rice varieties express their full yield potential when water supply is adequate.",
        "production":"In 2017, world production of paddy rice was 769.7 million metric tons (848.4 million short tons)s,[40] led by China and India with a combined 49% of this total.[1] Other major producers were Indonesia, Bangladesh and Vietnam. The five major producers accounted for 72% of total production, while the top fifteen producers accounted for 91% of total world production in 2017 (see table on right). Developing countries account for 95% of the total production.",
        "image1":"https://cdn.britannica.com/99/150499-050-ECBF2AED/Rice-cultivation-path-flooded-rice-paddy-Philippines.jpg",
        "image2":"https://www.wideopeneats.com/wp-content/uploads/2020/08/rice-FI.jpg"
    },
    "watermelon":{
        "common name":"Watermelon • Hindi: तरबूज़ Tarbooz • Manipuri: ꯇꯔꯕꯨꯖ Tarbuj • Marathi: Kadu vrindavana • Telugu: Eriputccha • Kannada: Kallangadi balli • Bengali: Tormuj • Urdu: Tarbooz • Gujarati: ઇંદ્રક Indrak • Mizo: Dawnfawh",
        "description1":"Watermelon is a sweet and refreshing low calorie summer snack. It provides hydration and also essential nutrients, including vitamins, minerals, and antioxidants.Along with cantaloupe, honeydew, and cucumber, watermelons are a member of the Cucurbitaceae family.",
        "plant":"The watermelon is a crawling and climbing plant with lengthy stems and leaves divided in lobes. Its fruit is a berry that may weigh up to 15kg, with a hard green rind and a sweet pulp of more or less reddish colour. ... Its scientific name is Citrullus vulgaris. It has some herbaceous stems that may reach 5m of length.",
        "fruit":"The watermelon is a large fruit of a more or less spherical shape. ... It has an oval or spherical shape and a dark green and smooth rind, sometimes showing irregular areas of a pale green colour. It has a sweet, juicy, refreshing flesh of yellowish or reddish colour, containing multiple black, brown or white seeds.",
        "cultivation":"Watermelons prefer a soil pH between 6 and 6.8. Growing the vines in raised rows, known as hills, ensures good drainage and will hold the sun's heat longer. Space the plants about 2 feet apart in a 5-foot-wide hill. If you're growing in rows, space 6 feet apart by 6 feet apart.",
        "production":"Worldwide 117,204,081 tonnes of watermelon is produced per year China is the largest watermelon producer in the world with 79,244,271 tonnes production volume per year Turkey comes second with 3,928,892 tonnes yearly production.India is with 427,105 is ranked at 25.",
        "image1":"https://5.imimg.com/data5/QH/WS/MY-29907888/watermelon-plants-500x500.png",
        "image2":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSgCYeqe4bRnXpWVK7Oq2NqN35wX0ynmq_oTA&usqp=CAU"
    },
    "wheat":{
        "common name":"Wheat • Hindi: गेहूँ Gehun • Kannada: Godhi • Manipuri: গেহূঁ Gehun • Marathi: गेहूँ Gehun • Sanskrit: arupa, bahudugdha, godhuma • Tamil: godumai, godumbaiyarisi • Telugu: godumalu • Urdu: Gehun",
        "description1":" Wheat is a grass widely cultivated for its seed, a cereal grain which is a worldwide staple food. The many species of wheat together make up the genus Triticum; the most widely grown is common wheat (T. aestivum). ... Botanically, the wheat kernel is a type of fruit called a caryopsis.",
        "plant":"The wheat plant has long slender leaves and stems that are hollow in most varieties. The inflorescences are composed of varying numbers of minute flowers, ranging from 20 to 100. The flowers are borne in groups of two to six in structures known as spikelets, which later serve to house the subsequent two or three grains produced by the flowers",
        "fruit":"wheat fruit is caryopsis type.In botany, a caryopsis (plural caryopses) is a type of simple dry fruit—one that is monocarpellate (formed from a single carpel) and indehiscent (not opening at maturity) and resembles an achene, except that in a caryopsis the pericarp is fused with the thin seed coat.",
        "cultivation":"Wheat is grown in a variety of soils of India. Soils with a clay loam or loam texture, good structure and moderate water holding capacity are ideal for wheat cultivation. ... Soil should be neutral in its reaction. Heavy soil with good drainage are suitable for wheat cultivation under dry conditions.",
        "production":"The global trade of wheat is greater than all other crops combined. In 2017, the total global production of wheat was 772 million tons. It is the second-most produced cereal grain behind maize. Based on 2017 data, the European Union is the largest producer of wheat, producing 150.2 million metric tons of wheat. China, India, and Russia, the three largest wheat producers, account for about 41% of the world’s total wheat production.",
        "image1":"https://i.pinimg.com/originals/d1/ae/b7/d1aeb7d53db4868e6b7b65d2040b5408.jpg",
        "image2":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSEC9mNunsV-ZM7nJrswbv2xjmNNdQ8nOPtxQ&usqp=CAU"
    }

}