{
    "Black gram":{
        "common name":"Black gram, urd bean, urad bean, black lentil, black matpe bean, mungo bean [English]; ambérique, haricot urd [French]; feijão-da-India, feijão-preto [Portuguese]; frijol mungo, fréjol negro, frijol negro, lenteja negra, urd [Spanish]; Urdbohne, Linsenbohne [German]; fagiolo indiano nero, fagiolo mungo nero [Italian]; mchooko mweusi [Swahili]; Đậu mười [Vietnamese]; عدس أسود[Arabic]; বিউলি, কলাই , মাসকলাই  [Bengali]; અડદ [Gujarati]; उड़द दाल [Hindi]; ケツルアズキ [Japanese]; ವಿಗ್ನಾ ಮುಂಗೊ [Kannada]; ഉഴുന്ന് [Malayalam]; उडीद [Marathi]; मास [Nepali]; Урд [Russian]; උඳු [Sinhala]; உளுந்து [Tamil]; మినుములు [Telugu]; ถั่วดำ [Thai] Black gram fodder Black gram straw, black gram haulms, urd bhoosa Black gram seeds Black gram chuni, Black gram bran, urd chuni, mashkalai bran, moong chuni",
        "description1":"Black gram (Vigna mungo (L.) Hepper) is an erect, fast-growing annual, herbaceous legume reaching 30-100 cm in height. It has a well-developed taproot and its stems are diffusely branched from the base. Occasionally it has a twining habit and it is generally pubescent. The leaves are trifoliate with ovate leaflets, 4-10 cm long and 2-7 cm wide. The inflorescence is borne at the extremity of a long (up to 18 cm) peduncle and bears yellow, small, papilionaceous flowers. The fruit is a cylindrical, erect pod, 4-7 cm long x 0.5 cm broad. The pod is hairy and has a short hooked beak. It contains 4-10 ellipsoid black or mottled seeds (Ecocrop, 2011; Jansen, 2006). Many Vigna mungo cultivars exist, each one adapted to specific environmental conditions. Early maturing, disease resistant and easily cultivated cultivars have been obtained (Jansen, 2006).",
        "description2":"Vigna mungo resembles green gram (Vigna radiata (L.) R. Wilczek) with two main differences: the corolla of Vigna mungo is bright yellow while that of Vigna radiata is pale yellow; black gram pods are erect whereas they are pendulous for green gram. Black gram is somewhat more hairy than green gram; the white hilum also protrudes from the seed. Black gram is sown on heavier soils and green gram is sown on lighter soils (Göhl, 1982) Vigna mungo seeds are mainly a staple food and the dehulled and split seeds (dhal in Hindi) are a common dish in South Asia. They can be ground into flour and used for making papadum, a typical Indian flat bread (Jansen, 2006). Seeds, sprouts and green pods are edible and much appreciated for their high digestibility and lack of flatulence induction (Jansen, 2006; Fery, 2002). The seeds are normally too expensive to be used as a feed, even in areas of primary production (Rajaguru et al., 1985). The by-product of dhal processing (chuni or bran) constitutes about 15-20% of the seed weight and comprises hulls, germs and broken seeds. Chuni is a potential feed resource and large quantities are available in India and other Southern Asian countries where black gram is a popular food (Reddy et al., 2000).",
        "environmental impact":"Vigna mungo has a taproot. It is an N-fixing legume that improves soil fertility and soil physical properties (Parashar, 2006). Its cultivation does not require N fertilization but N fixation is improved by inoculation with local rhizobium strains (Sharma et al., 2011). Vigna mungo is responsive to P (40 kg/ha) and K (30 kg/ha) and only needs rough tillage and one or two weedings (Baligar et al., 2007; Jansen, 2006). "
    
    },
    "Chickpea":{
        "common name":"The chickpea or chick pea (Cicer arietinum) is an annual legume of the family Fabaceae, subfamily Faboideae.[2][3] Its different types are variously known as gram[4][5] or Bengal gram,[5] garbanzo[5] or garbanzo bean, or Egyptian pea.[4] Chickpea seeds are high in protein. It is one of the earliest cultivated legumes, and 9500-year-old remains have been found in the Middle East.[6][7]",
        "description1":"The plant grows to 20–50 cm (8–20 in) high and has small, feathery leaves on either side of the stem. Chickpeas are a type of pulse, with one seedpod containing two or three peas. It has white flowers with blue, violet, or pink veins.",
        "description2":"Dozens of varieties of chickpea are cultivated throughout the world. In general, American and Iranian chickpeas are sweeter than Indian chickpeas. Kermanshah chickpeas in sizes 8 and 9 are considered to be among the highest quality in the world.[18]",
        "description3":"Desi chana has small, darker seeds and a rough coat. They are grown mostly in India and other parts of the Indian subcontinent, as well as in Ethiopia, Mexico, and Iran.[19] Desi means 'country' or 'native' in Hindi-Urdu; its other names include kala chana ('black chickpea' in Hindi-Urdu) or chholaa boot. Desi chana can be black, green or speckled. This variety is hulled and split to make chana dal.",
        "cultivation":"Agricultural yield for chickpea is often based on genetic and phenotypic variability which has recently been influenced by artificial selection.[32] The uptake of micronutrients such as inorganic phosphorus or nitrogen is vital to the plant development of Cicer arietinum, commonly known as the perennial chickpea.[33] Heat cultivation and micronutrient coupling are two relatively unknown methods that are used to increase the yield and size of the chickpea. Recent research has indicated that a combination of heat treatment along with the two vital micronutrients, phosphorus and nitrogen, are the most critical components to increasing the overall yield of Cicer arietinum."
    
    },
    "Coconut":{
       "common name":"The coconut tree (Cocos nucifera) is a member of the palm tree family (Arecaceae) and the only living species of the genus Cocos.[1] The term 'coconut' (or the archaic 'cocoanut')[2] can refer to the whole coconut palm, the seed, or the fruit, which botanically is a drupe, not a nut. The name comes from the old Portuguese word coco, meaning 'head' or 'skull', after the three indentations on the coconut shell that resemble facial features. They are ubiquitous in coastal tropical regions and are a cultural icon of the tropics.",
       "description1":"It is one of the most useful trees in the world and is often referred to as the 'tree of life'. It provides food, fuel, cosmetics, folk medicine and building materials, among many other uses. The inner flesh of the mature seed, as well as the coconut milk extracted from it, form a regular part of the diets of many people in the tropics and subtropics. Coconuts are distinct from other fruits because their endosperm contains a large quantity of clear liquid, called coconut water or coconut juice. Mature, ripe coconuts can be used as edible seeds, or processed for oil and plant milk from the flesh, charcoal from the hard shell, and coir from the fibrous husk. Dried coconut flesh is called copra, and the oil and milk derived from it are commonly used in cooking – frying in particular – as well as in soaps and cosmetics. Sweet coconut sap can be made into drinks or fermented into palm wine or coconut vinegar. The hard shells, fibrous husks and long pinnate leaves can be used as material to make a variety of products for furnishing and decoration.",
       "description2":"The coconut has cultural and religious significance in certain societies, particularly in the Western Pacific Austronesian cultures where it features in the mythologies, songs, and oral traditions. It also had ceremonial importance in pre-colonial animistic religions.[3][4] It has also acquired religious significance in South Asian cultures, where it is used in Hindu rituals. It forms the basis of wedding and worship rituals in Hinduism. It also plays a central role in the Coconut Religion of Vietnam. The falling nature of their mature fruit has led to preoccupation with death by coconut.[3][5]" ,
       "plant":"Cocos nucifera is a large palm, growing up to 30 m (100 ft) tall, with pinnate leaves 4–6 m (13–20 ft) long, and pinnae 60–90 cm (2–3 ft) long; old leaves break away cleanly, leaving the trunk smooth.[41] On fertile soil, a tall coconut palm tree can yield up to 75 fruits per year, but more often yields less than 30.[42][43][44] Given proper care and growing conditions, coconut palms produce their first fruit in six to ten years, taking 15 to 20 years to reach peak production.[45]",
       "fruit":"Botanically, the coconut fruit is a drupe, not a true nut.[48] Like other fruits, it has three layers: the exocarp, mesocarp, and endocarp. The exocarp is the glossy outer skin, usually yellow-green to yellow-brown in color. The mesocarp is composed of a fiber, called coir, which has many traditional and commercial uses. Both the exocarp and the mesocarp make up the husk of the coconut, while the endocarp makes up the hard coconut shell. The endocarp is around 4 mm (0.16 in) thick and has three distinctive germination pores (micropyles) on the distal end. Two of the pores are plugged (the eyes), while one is functional.[49][50]",
       "cultivation":"Coconut palms are normally cultivated in hot and wet tropical climates. They need year round warmth and moisture to grow well and fruit. Coconut palms are hard to establish in dry climates, and cannot grow there without frequent irrigation; in drought conditions, the new leaves do not open well, and older leaves may become desiccated; fruit also tends to be shed.[59] The extent of cultivation in the tropics is threatening a number of habitats, such as mangroves; an example of such damage to an ecoregion is in the Petenes mangroves of the Yucatán.[78]",
       "production":"Indonesia is the world's largest producer of coconuts, with gross production of 15 million tonnes.[96] A sprouting coconut seed is the logo for Gerakan Pramuka Indonesia, the Indonesian scouting organization.[97]"
    },
    "Coffee":{
        "common name":"A coffee bean is a seed of the Coffea plant and the source for coffee. It is the pip inside the red or purple fruit often referred to as a cherry. Just like ordinary cherries, the coffee fruit is also a so-called stone fruit. Even though the coffee beans are not technically beans, they are referred to as such because of their resemblance to true beans",
        "description1":"The two most economically important varieties of coffee plant are the Arabica and the Robusta; ~60% of the coffee produced worldwide is Arabica and ~40% is Robusta.[5] Arabica beans consist of 0.8–1.4% caffeine and Robusta beans consist of 1.7–4.0% caffeine.[6] As coffee is one of the world's most widely consumed beverages, coffee beans are a major cash crop and an important export product, accounting for over 50% of some developing nations' foreign exchange earnings.[7] In 2017, 70% of total coffee production was exported, worth USD 19.9 billion.[8]",
        "plant":"Botanically coffee belongs to the family Rubiaceae among with gardenias and quinine. The coffee plant can grow to a great height and because of that it is described as a coffee tree. In the wild it can grow as high as 10 metres. On plantations and coffee producing farms, they are pruned to a height which is most comfortable for harvesting.",
        "fruit":"The trees produce edible red or purple fruits, which are described either as epigynous berries or as indehiscent drupes.[4] The fruit is often referred to as a coffee cherry,and it contains two seeds, called coffee beans.[5] Despite these terms, coffee is neither a true cherry (the fruit of certain species in the genus Prunus) nor a true bean (seeds from plants in the family Fabaceae). The flowers of the plant are white and smell like jasmine and orange. Coffee plants flower at different times: Coffea arabica flowers after rain and Robusta flowers irregularly"  ,
        "cultivation":"The coffee plant needs plenty of rain to grow, something like 1,500–2,000 mm a year. The temperature for growing is different: for Arabica it is 15–24 ˚C and for Robusta it is 24–30 ˚C as coffee is extremely vulnerable to frost. Its habitat is at high altitudes. For Arabica the optimum growth altitude is between 1000–2000 m above sea level and for Robusta it is around 100–700 m above sea level. The higher the altitude, the more aromatic the beans are when they ripen. Soil and the environment have also a very great influence on the flavour characteristics. Coffee is produced in about 60 countries. The biggest coffee producing countries are: Brazil, Colombia, Vietnam, Indonesia and India. Those countries mainly grow coffee for export. For example, Brazil exports around 23,000,000 sacks per year, and each sack weighs 60 kg.",
        "production":"Arabica is originally from Ethiopia and today it is grown around the world. Robusta was discovered in Congo and from there it has spread throughout tropical Africa and to Indonesia, Vietnam and beyond.About 65 % of the world’s output is Arabica, and 35 % is Robusta. Arabica's flavour is milder and has more nuances than Robusta. The strong flavour of Robusta makes it best suited to blends of dark roasted coffees like espresso or French-style coffees. Robusta also gives a stronger body and crema for espresso."
    },
    "Cotton":{

    },
    "Ground Nut":{

    },
    "Jute":{

    },
    "Kidney Beans":{

    },
    "Lentil":{

    },
    "Moth Beans":{

    },
    "Mung Bean":{

    },
    "Peas":{

    },
    "Pegeon Peas":{

    },
    "Rubber":{

    },
    "Sugar Cane":{

    },
    "Tea":{

    },
    "Tobacco":{

    },
    "apple":{

    },
    "grapes":{

    },
    "maize":{

    },
    "mango":{

    },
    "millet":{

    }



}